mbarbeau0545/Stm32PrjTpl/src/1_FMK/FMK_HAL/FMK_CDA/Src/FMK_CDA.c
    if (f_Adc_e > FMKCDA_ADC_NB || f_HwAdcCfg_e > FMKCDA_ADC_CFG_NB)
    {
        Ret_e = RC_ERROR_PARAM_INVALID;
    }
    if (Ret_e == RC_OK)
    {
        bspAdcInit_s = &g_AdcInfo_as[f_Adc_e].BspInit_s.Init;
        // Set shared Init varaible
        bspAdcInit_s->ClockPrescaler = ADC_CLOCK_SYNC_PCLK_DIV4;
        bspAdcInit_s->Resolution = ADC_RESOLUTION_12B;
        bspAdcInit_s->DataAlign = ADC_DATAALIGN_RIGHT;
        bspAdcInit_s->SamplingTimeCommon = ADC_SAMPLETIME_13CYCLES_5; // Assuming a default value
        bspAdcInit_s->EOCSelection = ADC_EOC_SEQ_CONV;
        bspAdcInit_s->LowPowerAutoPowerOff = ENABLE;
        switch (f_HwAdcCfg_e)
        {
        case FMKCDA_ADC_CFG_BASIC_REGISTER:
        {
            bspAdcInit_s->ScanConvMode = DISABLE;
            bspAdcInit_s->ContinuousConvMode = DISABLE;
            bspAdcInit_s->DiscontinuousConvMode = DISABLE;
            bspAdcInit_s->DMAContinuousRequests = DISABLE;
            bspAdcInit_s->ExternalTrigConv = ADC_SOFTWARE_START;
            bspAdcInit_s->ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_NONE;
            break;
        }
        case FMKCDA_ADC_CFG_PERIODIC_INTERRUPT:
        {
            bspAdcInit_s->ScanConvMode = DISABLE;
            bspAdcInit_s->ContinuousConvMode = ENABLE;
            bspAdcInit_s->DiscontinuousConvMode = DISABLE;
            bspAdcInit_s->DMAContinuousRequests = DISABLE;
            bspAdcInit_s->ExternalTrigConv = ADC_SOFTWARE_START;
            bspAdcInit_s->ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_NONE;
            break;
        }
        case FMKCDA_ADC_CFG_PERIODIC_DMA:
        {
            bspAdcInit_s->ScanConvMode = DISABLE;
            bspAdcInit_s->ContinuousConvMode = ENABLE;
            bspAdcInit_s->DiscontinuousConvMode = DISABLE;
            bspAdcInit_s->DMAContinuousRequests = ENABLE;
            bspAdcInit_s->ExternalTrigConv = ADC_SOFTWARE_START;
            bspAdcInit_s->ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_NONE;
            setAdc_NVIC_b = True;
            break;
        }
        case FMKCDA_ADC_CFG_SCAN_INTERRUPT:
        {
            bspAdcInit_s->ScanConvMode = ENABLE;
            bspAdcInit_s->ContinuousConvMode = DISABLE;
            bspAdcInit_s->DiscontinuousConvMode = DISABLE;
            bspAdcInit_s->DMAContinuousRequests = DISABLE;
            bspAdcInit_s->ExternalTrigConv = ADC_SOFTWARE_START;
            bspAdcInit_s->ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_NONE;
            break;
        }
        case FMKCDA_ADC_CFG_SCAN_DMA:
        {
            bspAdcInit_s->ScanConvMode = ADC_SCAN_ENABLE;
            bspAdcInit_s->ContinuousConvMode = DISABLE;
            bspAdcInit_s->DiscontinuousConvMode = DISABLE;
            bspAdcInit_s->DMAContinuousRequests = ENABLE;
            bspAdcInit_s->ExternalTrigConv = ADC_SOFTWARE_START;
            bspAdcInit_s->ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_NONE;
            setAdc_NVIC_b = True;
            break;
        }
        case FMKCDA_ADC_CFG_TRIGGERED_REGISTER:
        {
            bspAdcInit_s->ScanConvMode = DISABLE;
            bspAdcInit_s->ContinuousConvMode = DISABLE;
            bspAdcInit_s->DiscontinuousConvMode = DISABLE;
            bspAdcInit_s->DMAContinuousRequests = DISABLE;
            bspAdcInit_s->ExternalTrigConv = ADC_EXTERNALTRIGCONV_T1_CC4; // Example trigger source
            bspAdcInit_s->ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_RISING;
            break;
        }
        case FMKCDA_ADC_CFG_TRIGGERED_INTERRUPT:
        {
            bspAdcInit_s->ScanConvMode = DISABLE;
            bspAdcInit_s->ContinuousConvMode = DISABLE;
            bspAdcInit_s->DiscontinuousConvMode = DISABLE;
            bspAdcInit_s->DMAContinuousRequests = DISABLE;
            bspAdcInit_s->ExternalTrigConv = ADC_EXTERNALTRIGCONV_T1_CC4; // Example trigger source
            bspAdcInit_s->ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_RISING;
            break;
        }
        case FMKCDA_ADC_CFG_TRIGGERED_DMA:
        {
            bspAdcInit_s->ScanConvMode = DISABLE;
            bspAdcInit_s->ContinuousConvMode = DISABLE;
            bspAdcInit_s->DiscontinuousConvMode = DISABLE;
            bspAdcInit_s->DMAContinuousRequests = ENABLE;
            bspAdcInit_s->ExternalTrigConv = ADC_EXTERNALTRIGCONV_T1_CC4; // Example trigger source
            bspAdcInit_s->ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_RISING;
            setAdc_NVIC_b = True;
            break;
        }
        case FMKCDA_ADC_CFG_NB:
        default:
            Ret_e = RC_WARNING_NO_OPERATION;
        }
        // CAllBsp Func
        Ret_e = FMKCPU_Set_HwClock(g_AdcInfo_as[f_Adc_e].clock_e, FMKCPU_CLOCKPORT_OPE_ENABLE);
        if((Ret_e == RC_OK) 
        && setAdc_NVIC_b == (t_bool)True)
        {
            Ret_e = FMKCPU_Set_NVICState(FMKCPU_NVIC_ADC1_IRQN, FMKCPU_NVIC_OPE_ENABLE);
        }
        if (Ret_e == RC_OK)
        {
            BspRet_e = HAL_ADC_Init(&g_AdcInfo_as[f_Adc_e].BspInit_s);

            if (BspRet_e == HAL_OK)
            {
                g_AdcInfo_as[f_Adc_e].IsAdcConfigured_b = (t_bool)True;
            }
        }
        else
        {
            Ret_e = RC_ERROR_WRONG_STATE;
        }
    }
    return Ret_e;
}

/*********************************
 * s_FMKCDA_Set_BspChannelCfg
 *********************************/
static t_eReturnState s_FMKCDA_Set_BspChannelCfg(t_eFMKCDA_Adc f_Adc_e, t_eFMKCDA_AdcChannel f_channel_e)
{
    t_eReturnState Ret_e = RC_OK;
    HAL_StatusTypeDef BspRet_e = HAL_OK;
    t_uint32 bspChannel_u32 = 0;

    ADC_ChannelConfTypeDef BspChannelInit_s = {.SamplingTime = ADC_SAMPLETIME_13CYCLES_5}; // all channel ave this cfg

    if (f_Adc_e > FMKCDA_ADC_NB)
    {
        Ret_e = RC_ERROR_PARAM_INVALID;
    }
    if(g_AdcInfo_as[f_Adc_e].IsAdcConfigured_b == (t_bool)False)
    {
        Ret_e = RC_ERROR_ALREADY_CONFIGURED;
    }
    if (Ret_e == RC_OK)
    {
        // configure channel
        Ret_e = s_FMKCDA_Get_BspChannel(f_channel_e, &bspChannel_u32);

        if (Ret_e == RC_OK)
        {
            BspChannelInit_s.Channel = bspChannel_u32;
            BspChannelInit_s.Rank = g_counterRank_au8[f_Adc_e];
            BspRet_e = HAL_ADC_ConfigChannel(&g_AdcInfo_as[f_Adc_e].BspInit_s,
                                             &BspChannelInit_s);

            if (BspRet_e == HAL_OK)
            {
                // update mapping
                g_AdcBuffer_as[f_Adc_e].BspChnlmapp[g_counterRank_au8[f_Adc_e]] = f_channel_e;
                // update info
                g_AdcInfo_as[f_Adc_e].Channel_as[f_channel_e].IsChnlConfigured_b = (t_bool)True;
                g_AdcInfo_as[f_Adc_e].Channel_as[f_channel_e].IsChnlUsed_b = (t_bool)True;
                g_counterRank_au8[f_Adc_e] += (t_uint8)1;
            }
            else
            {
                Ret_e = RC_ERROR_WRONG_STATE;
            }
        }
    }
    return Ret_e;
}

//********************************************************************************
//                      HAL_Callback Implementation
//********************************************************************************
void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef *hadc)
{
    t_uint8 LLI_u8 = 8;
    t_eFMKCDA_Adc IT_Adc_e = FMKCDA_ADC_NB;
    for (LLI_u8 = (t_uint8)0; LLI_u8 < (t_uint8)FMKCDA_ADC_NB; LLI_u8++)
    {
        if (&g_AdcInfo_as[LLI_u8].BspInit_s == (ADC_HandleTypeDef *)hadc)
        {
            IT_Adc_e = (t_eFMKCDA_Adc)LLI_u8;
            break;
        }
    }
    
    if (IT_Adc_e < FMKCDA_ADC_NB)
    {
        g_AdcBuffer_as[IT_Adc_e].FlagValueUpdated_b = (t_bool)True;
        g_AdcInfo_as[IT_Adc_e].IsAdcRunning_b = (t_bool)False;
    }
    return;
}
//************************************************************************************
// End of File
//************************************************************************************

/**
 *
 *	@brief
 *	@note   
 *
 *
 *	@params[in]
 *	@params[out]
 *
 *
 *
 */
